Revit 2026 API

# AreaLoadCreate(Document, ElementId, IListCurveLoop, XYZ, AreaLoadType) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static AreaLoad Create(
	Document document,
	ElementId hostElemId,
	IList<CurveLoop> loops,
	XYZ forceVector,
	AreaLoadType symbol
)
```
```vb
Public Shared Function Create (
	document As Document,
	hostElemId As ElementId,
	loops As IList(Of CurveLoop),
	forceVector As XYZ,
	symbol As AreaLoadType
) As AreaLoad
```
```cpp
public:
static AreaLoad^ Create(
	Document^ document,
	ElementId^ hostElemId,
	IList<CurveLoop^>^ loops,
	XYZ^ forceVector,
	AreaLoadType^ symbol
)
```
```fsharp
static member Create :
        document : Document *
        hostElemId : ElementId *
        loops : IList<CurveLoop> *
        forceVector : XYZ *
        symbol : AreaLoadType -> AreaLoad
```

#### Parameters

document Document

hostElemId ElementId

loops IListCurveLoop

forceVector XYZ

symbol AreaLoadType

#### Return Value

AreaLoad

#### Reference

AreaLoad Class

Create Overload

Autodesk.Revit.DB.Structure Namespace